---
kind: type
id: T:Autodesk.Revit.DB.Structure.PathReinforcement
source: html/1593a849-b883-73d4-7c02-a2522877d71d.htm
---
# Autodesk.Revit.DB.Structure.PathReinforcement

An object that represents an Path Reinforcement within the Autodesk Revit project.

## Syntax (C#)
```csharp
public class PathReinforcement : Element
```

## Remarks
This object derived from the Element base object and such supports all the
 methods of that object such as the ability to retrieve the parameters of that object.